app/controllers/shouts_controller.rb

  def index
    @shout      = Shout.order('RANDOM()').first
---
SELECT "shouts".* FROM "shouts" ORDER BY RANDOM() LIMIT 1

  def show
    @shout = Shout.find(params[:id])
---
SELECT "shouts".* FROM "shouts" WHERE "shouts"."id" = 1 LIMIT 1

  def create
    @shout = Shout.new(params[:shout])

    respond_to do |format|
      if @shout.save
---
INSERT INTO "shouts" ("message", "upvotes", "downvotes", "created_at", "updated_at") VALUES ('Holy fuck it''s Ruby on Rails', NULL, NULL, '2011-03-03 02:15:54.544748', '2011-03-03 02:15:54.544748')